"appName" = "Inlaider (ar)";


"popup.command.placeholder.typeACommand" = "اكتب أمرًا...";
"popup.command.placeholder.typeACommandOrEnterQuit" = "اكتب أمرًا أو اضغط Enter للإغلاق...";
"popup.command.placeholder.typeACommandOrEnterPaste" = "اكتب أمرًا أو اضغط Enter للصق النتيجة";
"popup.navigation.focusCanvas.label" = "⌘ ⬆️ — التبديل إلى المحرر";
"popup.navigation.focusCommandline.label" = "⌘ ⬇️ — التبديل إلى سطر الأوامر";
"popup.shortcut.clearCanvas" = "⌘⌫ يمسح المحرر";
"popup.shortcut.copyCanvas" = "⌘C ينسخ محتوى المحرر";
"popup.shortcut.copyCanvasOrEnterCopy" = "⌘C أو Enter ينسخ محتوى المحرر";
"popup.shortcut.enterPaste" = "Enter يلصق إلى";
"popup.shortcut.esc" = "Esc يغلق إلى";

"show" = "عرض";
"about" = "حول البرنامج";
"quit" = "إنهاء";
"close" = "إغلاق";
"cancel" = "إلغاء";
"save" = "حفظ";
"ok" = "موافق";
"settings" = "الإعدادات";
"copied" = "تم النسخ";

"settings.section.general.title" = "عام";
"settings.accessibility.title" = "أذونات الوصول";
"settings.accessibility.description" = "هذا الإذن مطلوب لقراءة النص المحدد تلقائيًا وإعادة إدراج النتيجة المعالجة في حقل النص الأصلي.\nبدون الوصول، ستستخدم التطبيق الحافظة لنقل البيانات.";
"settings.inlaiderShortcut.label" = "اختصار لوحة المفاتيح لـ Inlaider";
"settings.LaunchAtLogin.label" = "تشغيل عند بدء التشغيل";

"settings.section.ownAPIKeys.title" = "مفاتيح API الخاصة";
"provider.apiKey.title" = "مفتاح API";
"provider.apiKey.placeholder" = "أدخل مفتاح API هنا";
"provider.models.title" = "النماذج";
"provider.models.new.placeholder" = "أضف اسم النموذج";

"settings.section.customPrompts.title" = "استبدالات المطالبات";
"prompts.general.title" = "المطالبة العامة";
"prompts.replacements.title" = "استبدالات المطالبات";
"prompts.replacements.replaceWhat.label" = "استبدل";
"prompts.replacements.model.label" = "نموذج";
"prompts.replacements.replaceWith.label" = "إلى المطالبة";
"prompts.replacements.error.exists.message" = "استبدال الأمر '%@' موجود بالفعل.";

"about.ThirdPartyLicenses" = "تراخيص الطرف الثالث";
"about.VisitOnGithub" = "زيارة على GitHub";
"about.version" = "الإصدار %@";

"error.title" = "خطأ";
